Repository: ic1998/Cor-En
Catalog: TMX_datasets/9_en_kw.tmx
Source language: en
Languages: kw

source: I still need to clean the kitchen.
kw: Res yw dhymm hwath glanhe an gegin.

source: I don't like pork.
kw: Nyns yw da genev kig mogh.

source: Why do you want to go fishing?
kw: Prag y fynn'ta mos pyskessa?

source: You don't need to be there.
kw: Nyns yw res dhis bos ena.

source: Where can I buy a surfboard?
kw: Ple hallav prena astel omborth?

source: Those tulips are beautiful.
kw: An bleujyow tulyfant na yw teg.

source: I like water.
kw: Da yw genev dowr.

source: That is ugly.
kw: Henn yw hager.

source: Werewolves are better than vampires.
kw: Gourvleydhes yw gwell ages sugneres-goos.

source: Is this your first examination?
kw: Yw hemma dha gensa apposyans?

source: I am learning Gaelic.
kw: Yth esov vy ow tyski Godhalek.

source: I have seen a dog.
kw: My re welas ki.

source: The dogs are white.
kw: Gwynn yw an keun.

source: Dogs are white.
kw: Gwynn yw keun.

source: Open those doors!
kw: Ygor an darasow na!

source: Tom went to buy dog food.
kw: Tom eth prena boos ki.

source: I like raspberries.
kw: Da yw genev avan.

source: We're not sure.
kw: Nyns on sur.

source: Those are good.
kw: An re na yw da.

source: I like children.
kw: Da yw genev fleghes.

source: I hate that idea.
kw: Kas yw genev an tybyans na.

source: I hate those words.
kw: Kas yw genev an geryow na.

source: I am learning Spanish.
kw: Yth esov vy ow tyski Spaynek.

source: He needs to leave.
kw: Res yw dhodho diberth.

source: You liked to swim.
kw: Da o genes neuvya.

source: The dog is eating its food.
kw: Yma an ki ow tybri y voos.

source: The dog is eating his food.
kw: Yma an ki ow tybri y voos.

source: I prefer red.
kw: Gwell yw genev rudh.

source: I like ice cream.
kw: Da yw genev dehen rew.

source: It's five to four.
kw: Pymp dhe beder eur yw.

source: I have five friends.
kw: Yma pymp koweth dhymm.

source: The weather was beautiful.
kw: Teg o an gewer.

source: The weather was terrible.
kw: Euthyk o an gewer.

source: Tom's dog is very big.
kw: Ki Tom yw pur vras.

source: Where was everyone?
kw: Ple'th esa pubonan?

source: Tom's dog is white.
kw: Ki Tom yw gwynn.

source: This is rubbish.
kw: Hemm yw atal.

source: I didn't have to ask.
kw: Nyns o res dhymm govyn.

source: They want to come.
kw: I a vynn dos.

source: We don't have to be here.
kw: Nyns yw res dhyn bos omma.

source: I don't have a headache.
kw: Nyns eus drog penn dhymm.

source: Do you like horses?
kw: Yw da genes mergh?

source: We must do this.
kw: Res yw dhyn gul hemma.

source: I hate my neighbor.
kw: Kas yw genev ow hentrevek.

source: I hate that thing.
kw: Kas yw genev an dra na.

source: I hate that word.
kw: Kas yw genev an ger na.

source: I wanted to help.
kw: My a vynnas gweres.

source: I love this weather.
kw: My a gar an gewer ma.

source: I leave tomorrow.
kw: My a dhiberth a-vorow.

source: I had to see Tom.
kw: Res o dhymm gweles Tom.

source: I must have it.
kw: Res yw dhym y gavos.

source: I like to sail.
kw: Da yw genev golya.

source: I like these.
kw: Da yw genev an re ma.

source: They leave tomorrow.
kw: I a dhiberth a-vorow.

source: They like the idea.
kw: Da yw gansa an tybyans.

source: We need to stop.
kw: Res yw dhyn hedhi.

source: The sun was shining.
kw: Yth esa an howl ow splanna.

source: They want to stay.
kw: I a vynn gortos.

source: We have to study.
kw: Res yw dhyn studhya.

source: They were surprised.
kw: Yth esa marth dhedha.

source: We have to try.
kw: Res yw dhyn assaya.

source: We want to work.
kw: Ni a vynn oberi.

source: You have to work.
kw: Res yw dhis oberi.

source: She wanted to go out.
kw: Hi a vynnas mos yn-mes.

source: Write to me.
kw: Skrif dhymm.

source: That is a dog.
kw: Ki yw henna.

source: I like flowers.
kw: Da yw genev bleujyow.

source: We have a dog.
kw: Yma ki dhyn.

source: How?
kw: Fatla?

source: I have to start.
kw: Res yw dhymm dalleth.

source: It's raining today.
kw: Yma hi ow kul glaw hedhyw.

source: I like yellow.
kw: Da yw genev melyn.

source: Tom doesn't like chocolate.
kw: Nyns yw da gans Tom choklet.

source: Do you have to work on Sundays?
kw: Yw res dhis oberi dy Sul?

source: She doesn't like fish.
kw: Nyns yw da gensi pysk.

source: Tom doesn't like to fly.
kw: Nyns yw da gans Tom nejya.

source: He is twenty-four years old.
kw: Peswar bloodh warn ugens yw ev.

source: He's twenty-four years old.
kw: Peswar bloodh warn ugens yw ev.

source: I don't want to swim.
kw: Ny vynnav vy neuvya.

source: I hate school!
kw: Kas yw genev skol!

source: Is that a bird?
kw: Yw honna edhen?

source: I hate school.
kw: Kas yw genev skol.

source: We hate Tom.
kw: Kas yw genen Tom.

source: This is a big dog.
kw: Hemm yw ki bras.

source: I must write books.
kw: Res yw dhymm skrifa lyvrow.

source: I understand!
kw: My a gonvedh!

source: Greetings from Cornwall!
kw: Gorhemynadow a Gernow!

source: I'm trying to remember the name of the book.
kw: Yth esov vy owth assaya perthi kov hanow an lyver.

source: I was trying to remember the name of the book.
kw: Yth esen vy owth assaya perthi kov hanow an lyver.

source: Good dog!
kw: Ki da!

source: I walked.
kw: My a wrug kerdhes.

source: I had four children.
kw: Yth esa peswar flogh dhymm.

source: I swam.
kw: My a wrug neuvya.

source: I hate Christmas.
kw: Kas yw genev Nadelik.

source: I am eating bread.
kw: Yth esov vy ow tybri bara.

source: They must stay.
kw: Res yw dhedha gortos.

source: You must stay.
kw: Res yw dhis gortos.

source: Do you need to buy anything?
kw: Yw res dhis prena neppyth?

source: I don't like animals.
kw: Nyns yw da genev enevales.

source: They have to come.
kw: Res yw dhedha dos.

source: I had to stay home.
kw: Res o dhymm gortos tre.

source: We need to do this.
kw: Res yw dhyn gul hemma.

source: We had to do that.
kw: Res o dhyn gul henna.

source: I'll have to do that.
kw: Res vydh dhymm gul henna.

source: We don't want to wait.
kw: Ny vynnyn ni gortos.

source: This is not a dog.
kw: Nyns yw hemma ki.

source: We had to do something.
kw: Res o dhyn gul neppyth.

source: I don't like cold weather.
kw: Nyns yw da genev kewer yeyn.

source: The cloud is grey.
kw: Loos yw an komolen.

source: I was reading.
kw: Yth esen vy ow redya.

source: I like dogs and cats.
kw: Da yw genev keun ha kathes.

source: I like school.
kw: Da yw genev skol.

source: She likes books too.
kw: Da yw gensi lyvrow ynwedh.

source: She likes books also.
kw: Da yw gensi lyvrow ynwedh.

source: It's ten past four now.
kw: Deg wosa peder eur yw lemmyn.

source: I must buy shoes.
kw: Res yw dhymm prena eskisyow.

source: You must wait.
kw: Res yw dhis gortos.

source: I hate work.
kw: Kas yw genev ober.

source: I hate to travel.
kw: Kas yw genev viajya.

source: You don't need to work today.
kw: Nyns yw res dhis oberi hedhyw.

source: He needs to come.
kw: Res yw dhodho dos.

source: I worked.
kw: My a wrug oberi.

source: We used to play together.
kw: Ni a wre gwari war-barth.

source: Six and four are ten.
kw: Hwegh ha peswar yw deg.

source: She's not poor.
kw: Nyns yw hi boghosek.

source: That dog's name is Ken.
kw: Hanow an ki na yw Ken.

source: I prepared dinner.
kw: My a bareusis kinnyow.

source: What's the weather like now?
kw: Fatel yw an gewer lemmyn?

source: Tom's dog can swim well.
kw: Ki Tom a yll neuvya yn ta.

source: I had to stay.
kw: Res o dhymm gortos.

source: Bring me another beer.
kw: Ro dhymm korev aral.

source: You don't need to lie.
kw: Nyns yw res dhis gowleverel.

source: I prefer English.
kw: Gwell yw genev Sowsnek.

source: Why do you want to go away?
kw: Prag y fynn'ta mos dhe-ves?

source: Does she want to go away?
kw: A vynn hi mos dhe-ves?

source: He lives in the clouds.
kw: Ev a drig y'n kommol.

source: I like to eat meat.
kw: Da yw genev dybri kig.

source: Tom doesn't like beer.
kw: Nyns yw da gans Tom korev.

source: I hate that colour.
kw: Kas yw genev an liw na.

source: I was sorry.
kw: Drog o genev.

source: It's snowing again.
kw: Yma hi ow kul ergh arta.

source: At what time do you start work?
kw: Dhe by eur a wre'ta dalleth ober?

source: I like to eat fish.
kw: Da yw genev dybri pysk.

source: Here is Mary's dog.
kw: Ottomma ki Mary.

source: I was eager to visit Tom.
kw: Mall o genev visitya Tom.

source: I had to leave my job.
kw: Res o dhymm diberth ow ober.

source: We didn't have to wait.
kw: Nyns o res dhyn gortos.

source: Congratulations to you!
kw: Keslowena dhis!

source: I must do that.
kw: Res yw dhymm gul henna.

source: I had gray hair.
kw: Yth esa gols loos dhymm.

source: I used to live here.
kw: My a wre triga omma.

source: We used to do that.
kw: Ni a wre gul henna.

source: I used to smoke.
kw: My a wre megi.

source: Tom must come.
kw: Res yw dhe Tom dos.

source: I'm trying to understand.
kw: Yth esov vy owth assaya konvedhes.

source: It is wet.
kw: Glyb yw hi.

source: It is hot.
kw: Tomm yw hi.

source: It is sunny.
kw: Howlyek yw hi.

source: Isn't the weather bad?
kw: Ass yw drog an gewer?

source: Isn't the weather great?
kw: Ass yw splann an gewer?

source: Isn't the weather good?
kw: Ass yw da an gewer?

source: I live in a house in Truro.
kw: Trigys ov vy yn chi yn Druru.

source: I'm going to the pub.
kw: My a wra mos dhe'n diwotti.

source: A man without his language has lost his land.
kw: Den heb tavas a gollas y dir.

source: I still have a headache.
kw: Yma drog penn dhymm hwath.

source: I prefer black.
kw: Gwell yw genev du.

source: The dog is in the yard.
kw: Yma an ki y'n garth.

source: Is the dog in the yard?
kw: Usi an ki y'n garth?

source: Yes, it is a dog.
kw: Yw, ki yw.

source: Is this a dog?
kw: Yw hemma ki?

source: I was painting.
kw: Yth esen vy ow payntya.

source: I don't have to study tonight.
kw: Nyns yw res dhymm studhya haneth.

source: What colour is the book?
kw: Py liw yw an lyver?

source: The sun is yellow.
kw: Melyn yw an howl.

source: What colour is the apple?
kw: Py liw yw an aval?

source: I must eat slowly.
kw: Res yw dhymm dybri yn lent.

source: I don't have to do that.
kw: Nyns yw res dhymm gul henna.

source: I need to learn.
kw: Res yw dhymm dyski.

source: I have to learn.
kw: Res yw dhymm dyski.

source: You don't have to answer today.
kw: Nyns yw res dhis gorthebi hedhyw.

source: Tom doesn't like that idea.
kw: Nyns yw da gans Tom an tybyans na.

source: I still need to do that.
kw: Res yw dhymm hwath gul henna.

source: We still need to talk to Tom.
kw: Res yw dhyn hwath kewsel orth Tom.

source: Can I?
kw: A allav vy?

source: Here is the dog.
kw: Ottomma an ki.

source: She likes that dog.
kw: Da yw gensi an ki na.

source: Come here!
kw: Deus omma!

source: I didn't need to sell my car.
kw: Nyns o res dhymm gwertha ow harr.

source: What colour is this cat?
kw: Py liw yw an gath ma?

source: What colour is this flower?
kw: Py liw yw an vleujen ma?

source: She likes the rain.
kw: Da yw gensi an glaw.

source: He likes the rain.
kw: Da yw ganso an glaw.

source: She doesn't like Tom's dog.
kw: Nyns yw da gensi ki Tom.

source: She doesn't like oranges.
kw: Nyns yw da gensi owravalow.

source: She doesn't like coffee.
kw: Nyns yw da gensi koffi.

source: They need to answer the question.
kw: Res yw dhedha gorthebi an govyn.

source: They need to answer this question.
kw: Res yw dhedha gorthebi an govyn ma.

source: They have to answer the question.
kw: Res yw dhedha gorthebi an govyn.

source: I'm learning.
kw: Yth esov vy ow tyski.

source: They're hungry.
kw: Yma nown dheda.

source: I was dancing.
kw: Yth esen vy ow tonsya.

source: Is that a dog?
kw: Yw henna ki?

source: Do you like animals?
kw: Yw da genes enevales?

source: I'm a dog.
kw: Ki ov vy.

source: I don't want to study.
kw: Ny vynnav vy studhya.

source: The boy is buying a dog.
kw: Yma an maw ow prena ki.

source: That's their plan.
kw: Henn yw aga thowl.

source: Don't you have to go to school today?
kw: A nyns yw res dhis mos dhe'n skol hedhyw?

source: I am writing.
kw: Yth esov vy ow skrifa.

source: Don't you have to work?
kw: A nyns yw res dhis oberi?

source: Tom hates dogs.
kw: Kas yw gans Tom keun.

source: They need to go.
kw: Res yw dhedha mos.

source: You can't buy that.
kw: Ny yll'ta prena henna.

source: You can't buy this.
kw: Ny yll'ta prena hemma.

source: We had to do it again.
kw: Res o dhyn y wul arta

source: Tom doesn't like oranges.
kw: Nyns yw da gans Tom owravalow.

source: We don't need to go there.
kw: Nyns yw res dhyn mos ena.

source: It'll rain tomorrow.
kw: Hi a vydh glaw a-vorow.

source: Tom wants to get a dog.
kw: Tom a vynn kavos ki.

source: How is the weather outside?
kw: Fatel yw an gewer yn-mes?

source: We're not surprised.
kw: Nyns eus marth dhyn.

source: We're trying to help.
kw: Yth eson ni owth assaya gweres.

source: Whose dog is this?
kw: Piw ki yw hemma?

source: We needed to do that.
kw: Res yw dhyn gul henna.

source: Why do you want a dog?
kw: Prag y fynn'ta kavos ki?

source: Did you like that book?
kw: O da genes an lyver na?

source: I need to swim.
kw: Res yw dhymm neuvya.

source: Do you like dinosaurs?
kw: Yw da genes arghpedrevanes?

source: Tom doesn't like children.
kw: Nyns yw da gans Tom fleghes.

source: Tom doesn't like this game.
kw: Nyns yw da gans Tom an gwari ma.

source: I like playing with my dog.
kw: Da yw genev ow kwari gans ow hi.

source: She prepares their food.
kw: Hi a bareusis aga boos.

source: I'll have to go there tomorrow.
kw: Res vydh dhymm mos ena a-vorow.

source: I've been doing this for months.
kw: My re bia ow kul hemma rag misyow.

source: I hate holidays.
kw: Kas yw genev dygolyow.

source: I needed to go home.
kw: Res o dhymm mos tre.

source: You can't sing here.
kw: Ny yll'ta kana omma.

source: You can't go outside.
kw: Ny yll'ta mos yn-mes.

source: We're trying to understand.
kw: Yth eson ni owth assaya konvedhes.

source: Little dogs are the worst.
kw: Ki byghan yw an gwettha.

source: I needed to shut the door.
kw: Res o dhymm degea an daras.

source: I knew.
kw: My a wrug godhvos.

source: They're eager to see you.
kw: Mall yw gansa dha weles.

source: How is the weather in Germany?
kw: Fatel yw an gewer yn Almayn?

source: I don't have to go.
kw: Nyns yw res dhymm mos.

source: I still want to play.
kw: My a vynn hwath gwari.

source: You had to be there.
kw: Res o dhis bos ena.

source: I like to go places.
kw: Da yw genev mos leow.

source: I can't surf.
kw: Ny allav vy mordardha.

source: They don't like to dance.
kw: Nyns yw da gansa donsya.

source: We remember that.
kw: Yma kov dhyn a henna.

source: I hate hospitals.
kw: Kas yw genev klavjiow.

source: I hate music.
kw: Kas yw genev ilow.

source: We had to go there together.
kw: Res o dhyn mos ena war-barth.

source: We'll have to do that, too.
kw: Res vydh dhyn gul henna, ynwedh.

source: We don't need to do that.
kw: Nyns yw res dhyn gul henna.

source: I don't want to sing.
kw: Ny vynnav vy kana.

source: Tom walks the dog.
kw: Tom a gerdh an ki.

source: Can we get a dog?
kw: A yllyn ni kavos ki?

source: I was speaking.
kw: Yth esen vy ow kewsel.

source: Why do we need to learn this?
kw: Prag yth yw res dhyn dyski hemma?

source: I can't sing well.
kw: Ny allav vy kana yn ta.

source: I must do it.
kw: Res yw dhymm y wul.

source: I had a headache all day yesterday.
kw: Yth esa drog penn dhymm an jydh oll de.

source: I hate sweet drinks.
kw: Kas yw genev diwosow hweg.

source: Tom doesn't like to sing.
kw: Nyns yw da gans Tom kana.

source: I ran.
kw: My a wrug ponya.

source: I swim.
kw: My a wra neuvya.

source: I shouted.
kw: My a armas.

source: I can't ski.
kw: Ny allav vy skia.

source: I had a son.
kw: Yth esa mab dhymm.

source: I like wine.
kw: Da yw genev gwin.

source: I had to run.
kw: Res o dhymm ponya.

source: I liked that.
kw: Da o genev henna.

source: I ran inside.
kw: My a bonyas a-ji.

source: I can't work today.
kw: Ny allav vy oberi hedhyw.

source: She likes coffee.
kw: Da yw gensi koffi.

source: He must leave now.
kw: Res yw dhodho diberth lemmyn.

source: I'm studying.
kw: Yth esov vy ow studhya.

source: I need to eat.
kw: Res yw dhymm dybri.

source: I like cheese.
kw: Da yw genev keus.

source: I had to wait.
kw: Res o dhymm gortos.

source: I could do it.
kw: Ty a allas y wul.

source: I can't paint.
kw: Ny allav vy payntya.

source: I dislike Tom.
kw: Drog yw genev Tom.

source: I hate homework.
kw: Kas yw genev ober tre.

source: I'm displeased.
kw: My yw drog pes.

source: We didn't have to do that.
kw: Nyns o res dhyn gul henna.

source: They don't want to leave.
kw: Ny vynnons i diberth.

source: I had to hurry.
kw: Res o dhymm fistena.

source: I can't swim yet.
kw: Ny allav vy neuvya hwath.

source: I was thirsty.
kw: Yth esa seghes dhymm.

source: I can't read yet.
kw: Ny allav vy redya hwath.

source: I like to drink.
kw: Da yw genev eva.

source: I have a black dog.
kw: Yma ki du dhymm.

source: I like to write.
kw: Da yw genev skrifa.

source: I can't drive yet.
kw: Ny allav vy lewya hwath.

source: I can't leave yet.
kw: Ny allav vy diberth hwath.

source: I can't write yet.
kw: Ny allav vy skrifa hwath.

source: I hated the idea.
kw: Kas o genev an tybyans.

source: I must find work.
kw: Res yw dhymm kavos ober.

source: I had to say that.
kw: Res o dhymm leverel henna.

source: I shouted for help.
kw: My a armas rag gweres.

source: I used to eat meat.
kw: My a wre dybri kig.

source: I was very thirsty.
kw: Yth esa seghes bras dhymm.

source: I had to work late.
kw: Res o dhymm oberi diwedhes.

source: I like to do that.
kw: Da yw genev gul henna.

source: I didn't need to do that.
kw: Nyns o res dhymm gul henna.

source: I can't read music.
kw: Ny allav vy redya ilow.

source: I don't like beef.
kw: Nyns yw da genev kig bewin.

source: I'll have to wait.
kw: Res vydh dhymm gortos.

source: I still want to do that with you.
kw: My a vynn hwath gul henna genes.

source: We don't need to be here.
kw: Nyns yw res dhyn bos omma.

source: I still want to do that.
kw: My a vynn hwath gul henna.

source: I can't work tomorrow.
kw: Ny allav vy oberi a-vorow.

source: I hate this weather.
kw: Kas yw genev an gewer ma.

source: You don't have to do this!
kw: Nyns yw res dhis gul hemma!

source: I was waiting.
kw: Yth esen vy ow kortos.

source: I am sleeping.
kw: Yth esov vy ow koska.

source: Do you see the sky?
kw: A wre'ta gweles an ebron?

source: I was eating dinner.
kw: Yth esen vy ow tybri kinnyow.

source: I still want to do that with Tom.
kw: My a vynn hwath gul henna gans Tom.

source: I still want to come.
kw: My a vynn hwath dos.

source: I needed to buy food.
kw: Res o dhymm prena boos.

source: I hate this city.
kw: Kas yw genev an cita ma.

source: I'm smoking.
kw: Yth esov vy ow megi.

source: I hate snow.
kw: Kas yw genev ergh.

source: I hate rain.
kw: Kas yw genev glaw.

source: I can't work tonight.
kw: Ny allav vy oberi haneth.

source: I used to work here.
kw: My a wre oberi omma.

source: I've been listening.
kw: My re bia ow koslowes.

source: Do you like cake?
kw: Yw da genes tesen?

source: I hate cake.
kw: Kas yw genev tesen.

source: Is that cake?
kw: Yw honna tesen?

source: Is that snow?
kw: Yw henna ergh?

source: You'll have to take this bicycle.
kw: Res vydh dhis kemeres an dhiwros ma.

source: The sky is orange.
kw: Rudhvelyn yw an ebron.

source: The sky is red.
kw: Rudh yw an ebron.

source: The dog is eating.
kw: Yma an ki ow tybri.

source: I need to buy food.
kw: Yma edhomm dhymm a brena boos.

source: I've been studying.
kw: My re bia ow studhya.

source: I don't like milk.
kw: Nyns yw da genev leth.

source: I don't like fish.
kw: Nyns yw da genev pysk.

source: Cornwall is a Celtic country.
kw: Kernow yw bro geltek.

source: Cornish, Welsh and Breton are Celtic languages.
kw: Kernewek, Kembrek ha Bretonek yw yethow keltek.

source: I am windsurfing.
kw: Yth esov vy ow astelwolya.

source: The earthworm is in the ground.
kw: Yma'n bulugen y'n dor.

source: There are a lot of earthworms in the garden.
kw: Yma lies a vuluk y'n lowarth.

source: The otter was playing in the river.
kw: Yth esa an dowrgi ow kwari y'n avon.

source: The chough is similar to a blackbird.
kw: An balores yw haval orth molgh dhu.

source: I'm drinking coffee.
kw: Yth esov vy owth eva koffi.

source: Is that a wolf?
kw: Yw henna bleydh?

source: Is that a bear?
kw: Yw henna ors?

source: Is that a fox?
kw: Yw henna lowarn?

source: They write.
kw: I a wra skrif.

source: Who wants cake?
kw: Piw a vynn kavos tesen?

source: We were listening to music.
kw: Yth esen ni ow koslowes orth ilow.

source: The box is big and heavy.
kw: An kist yw bras ha poos.

source: You need to start!
kw: Res yw dhis dalleth!

source: What's that butterfly?
kw: Pyth yw an tykki Duw na?

source: Do I need to do that?
kw: Yw res dhymm gul henna?

source: Happy St Piran's Day!
kw: Gool Peran Lowen!

source: Do we have to do that?
kw: Yw res dhyn gul henna?

source: Butterflies are pretty.
kw: Teg yw tykkies Duw.

source: That's wet.
kw: Henn yw glyb.

source: That's a boat.
kw: Honn yw skath.

source: That's her girlfriend.
kw: Henn yw hy hares.

source: He was a bad ticket inspector.
kw: Tokynner drog o ev.

source: He is an awful ticket inspector.
kw: Tokynner euthyk yw ev.

source: She was as pretty as a primrose.
kw: Hi o mar deg avel brialli.

source: Did you have to wait a long time?
kw: O res dhis gortos termyn hir?

source: What'll the weather be like tomorrow?
kw: Fatel vydh an gewer a-vorow?

source: We'll have to do something.
kw: Res vydh dhyn gul neppyth.

source: This question is controversial.
kw: Gorthargyadow yw an govyn ma.

source: Mice are drinking the water.
kw: Ma logos oth ola an dowr.

source: That was on the news.
kw: Hedna o war an nowodhow.

source: Mennad wants to say something.
kw: Mennad a vynn leverel neppyth.
